{
  "_name_or_path": "/Users/danilapetrov/dev/personal/meeting-bot/model/detr",
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "ConditionalDetrForObjectDetection"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone": "resnet50",
  "backbone_config": null,
  "backbone_kwargs": {
    "in_chans": 3,
    "out_indices": [
      1,
      2,
      3,
      4
    ]
  },
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 2,
  "cls_loss_coefficient": 2,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "dice_loss_coefficient": 1,
  "dilation": false,
  "dropout": 0.1,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "focal_alpha": 0.25,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "id2label": {
    "0": "speaker",
    "1": "participant",
    "2": "shared screen"
  },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "label2id": {
    "participant": 1,
    "shared screen": 2,
    "speaker": 0
  },
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 1024,
  "model_type": "conditional_detr",
  "num_channels": 3,
  "num_hidden_layers": 6,
  "num_queries": 300,
  "position_embedding_type": "sine",
  "scale_embedding": false,
  "transformers_version": "4.42.3",
  "use_pretrained_backbone": true,
  "use_timm_backbone": true
}
